Assignment_1/FIO/q2/output_q2.txt
write: (g=0): rw=write, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=1
randwrite: (g=1): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=1
fio-3.28
Starting 2 processes
write: Laying out IO file (1 file / 64MiB)

write: (groupid=0, jobs=1): err= 0: pid=303094: Fri Apr 11 16:14:44 2025
  write: IOPS=33.9k, BW=132MiB/s (139MB/s)(64.0MiB/484msec); 0 zone resets
    clat (usec): min=22, max=8264, avg=28.96, stdev=66.47
     lat (usec): min=22, max=8264, avg=29.03, stdev=66.48
    clat percentiles (usec):
     |  1.00th=[   26],  5.00th=[   26], 10.00th=[   27], 20.00th=[   27],
     | 30.00th=[   28], 40.00th=[   28], 50.00th=[   28], 60.00th=[   28],
     | 70.00th=[   28], 80.00th=[   29], 90.00th=[   32], 95.00th=[   35],
     | 99.00th=[   49], 99.50th=[   59], 99.90th=[   88], 99.95th=[   96],
     | 99.99th=[ 2073]
  lat (usec)   : 50=99.10%, 100=0.85%, 250=0.04%
  lat (msec)   : 4=0.01%, 10=0.01%
  cpu          : usr=4.14%, sys=34.16%, ctx=16385, majf=0, minf=13
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,16384,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
randwrite: (groupid=1, jobs=1): err= 0: pid=303095: Fri Apr 11 16:14:44 2025
  write: IOPS=45.5k, BW=178MiB/s (186MB/s)(64.0MiB/360msec); 0 zone resets
    clat (usec): min=16, max=135, avg=21.33, stdev= 6.27
     lat (usec): min=16, max=163, avg=21.42, stdev= 6.36
    clat percentiles (usec):
     |  1.00th=[   18],  5.00th=[   19], 10.00th=[   19], 20.00th=[   19],
     | 30.00th=[   20], 40.00th=[   20], 50.00th=[   20], 60.00th=[   20],
     | 70.00th=[   20], 80.00th=[   23], 90.00th=[   27], 95.00th=[   31],
     | 99.00th=[   49], 99.50th=[   59], 99.90th=[   86], 99.95th=[   98],
     | 99.99th=[  110]
  lat (usec)   : 20=73.99%, 50=25.09%, 100=0.89%, 250=0.04%
  cpu          : usr=6.13%, sys=28.97%, ctx=16384, majf=0, minf=11
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,16384,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=132MiB/s (139MB/s), 132MiB/s-132MiB/s (139MB/s-139MB/s), io=64.0MiB (67.1MB), run=484-484msec

Run status group 1 (all jobs):
  WRITE: bw=178MiB/s (186MB/s), 178MiB/s-178MiB/s (186MB/s-186MB/s), io=64.0MiB (67.1MB), run=360-360msec

Disk stats (read/write):
  nvme0n1: ios=1/24995, merge=0/15, ticks=0/469, in_queue=471, util=47.64%